{
    "challenge1": {
        "challengeId": 613,
        "title": "Check Odd/Even",
        "question": "Write a program to check if the entered integer is odd or even.",
        "task":{
            "task1": "Enter an integer input for the variable number.",
            "task2": "Check if it is even or odd using if...else",
            "task3": "If the integer is exactly divisible by 2, print Even. Else, print Odd."
        }
   
    },
    "challenge2": {
        "challengeId": 629,
        "title": "Print Fibonacci Numbers Less Than n ",
        "question": "Write a program to print fibonacci numbers where last term is less than n.",
        "hint": "A Fibonacci sequence is a series of numbers where a number is the addition of the last two numbers. For example, 1 1 2 3 5",
        "task": {
            "task1": "Take integer input from the user and store it in n.",
            "task2": "Define two integer variables t1 and t2 both with the value of 1.",
            "task3": "Run a while loop as long as t1 is less than n.",
            "task4": "In each iteration, print the value of t1.",
            "task5": "Also, define the result variable as the sum of t1 and t2.",
            "task6": "Assign the value of t2 to t1.",
            "task7": "Assign the value of result to t2."
        }
    },
    "challenge3": {
        "challengeId": 638,
        "title": "Sum of Natural Numbers using Function",
        "question": "Write a program to find the sum of N natural numbers by creating a function.",
        "hint": null,
        "task": {
            "task1": "Define a function named find_sum() that takes n as an argument.",
            "task2": "Inside the function, compute the sum of numbers from 1 to n and return the total.",
            "task3": "Outside the function, get an integer input for a variable number.",
            "task4": "Call the function and pass number as an argument and print the return value."
        }
    },
    "challenge4": {
        "challengeId": 618,
        "title": "Smallest Among Three Numbers",
        "question": "Write a program to find the smallest among three numbers.",
        "hint": "A Fibonacci sequence is a series of numbers where a number is the addition of the last two numbers. For example, 1 1 2 3 5",
        "task": {
            "task1": "Take three integer inputs and store them in number1, number2, and number2.",
            "task2": "Print the smallest number between them using if...elif...else statement."
        }
    }
}